configuration.org

#+STARTUP: show2levels
#+EXPORT_FILE_NAME: README
#+OPTIONS: toc:3
#+OPTIONS: num:nil
* Intro
This configuration file contains setup my config of emacs
** Package Manager
*** ELPA Setup
set repository to tsinghua
#+BEGIN_SRC emacs-lisp
(require 'package)
;;  (setq package-archives '(("gnu"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
;;                           ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
;;                           ("org" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
;;                           ;;("melpa-stable" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa-stable/")
;;                           ;;("melpa-stable" . "http://elpa.emacs-china.org/stable-melpa/")
;;                           ))
(setq package-archives '(
                          ("gnu" . "https://elpa.gnu.org/packages/")
                          ("melpa" . "https://melpa.org/packages/")
                          ("org" . "https://orgmode.org/elpa/")
                          ("melpa-stable" . "https://stable.melpa.org/packages/")))
(unless (
          bound-and-true-p package--initialized)
  (package-initialize))

(unless package-archive-contents
  (package-refresh-contents))
#+END_SRC

#+RESULTS:
: ((gnu . https://elpa.gnu.org/packages/) (melpa . https://melpa.org/packages/) (org . https://orgmode.org/elpa/) (melpa-stable . https://stable.melpa.org/packages/))

*** Use-Package Setup
#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(setq package-enable-at-startup nil)
(setq use-package-always-ensure t)
#+end_src
*** COMMENT +Support Install Package Of Not in ELPA+
#+begin_src emacs-lisp
(use-package quelpa-use-package
  ;; :init
  ;; (setq quelpa-melpa-recipe-stores (list (expand-file-name "site-lisp" user-emacs-directory)))
  ;; (setq quelpa-dir (expand-file-name "site-lisp" user-emacs-directory))
  ;; (setq quelpa-melpa-dir (expand-file-name "melpa" quelpa-dir))
  ;; (setq quelpa-build-dir (expand-file-name "build" quelpa-dir))
  ;; (setq quelpa-package-dir (expand-file-name "package" quelpa-dir))

  )
#+end_src
** General Settings Setup
*** Window Settings
**** Window Maximized
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src
**** Zoom
window auto Zoom,current window Larger display
#+begin_src emacs-lisp
(use-package zoom
  :ensure t
  :init
  (setq zoom-size '(0.718 . 0.718))
  :bind ("C-c z" . zoom)
  )
#+end_src
*** Character Settings
#+begin_src emacs-lisp
(set-language-environment "UTF-8")
;; (setq locale-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)

(set-buffer-file-coding-system 'utf-8)
(set-default buffer-file-coding-system 'utf8)
(set-default-coding-systems 'utf-8)

(set-clipboard-coding-system 'utf-8)

(set-terminal-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(modify-coding-system-alist 'process "*" 'utf-8)

(setq-default pathname-coding-system 'utf-8)
(set-file-name-coding-system 'utf-8)
#+end_src
*** BackUp Settings
donot backup file
#+begin_src emacs-lisp
(setq auto-save-default nil)
;;(setq make-backup-files nil)
(setq backup-directory-alist (quote (("." . "~/.emacs.d/.backups"))))
;;(setq backup-directory-alist (expand-file-name ".backups" user-emacs-directory))
#+end_src
*** Custom-file Settings
#+begin_src emacs-lisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src
*** Yes/No Shorthand Settings
#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src
*** COMMENT Tabs Indentation Settings
#+begin_src emacs-lisp
  (use-package smart-tabs-mode)
		(setq tab-width 2)
		(setq-default tab-width 2)
		(setq-default indent-line-function 2)
		(setq-default lisp-indent-offset 2)
		(setq-default sgml-basic-offset 2)
		(smart-tabs-insinuate 'c 'c++ 'java 'javascript 'cperl 'python 'ruby 'nxml)
		(setq c-basic-offset 2)
		;; (setq tab-always-indent)
		(setq-default indent-tabs-mode nil)
		;; nxml-mode
		(setq
		 nxml-child-indent 2
		 nxml-attribute-indent 2
		 nxml-slash-auto-complete-flag t)
#+end_src

*** Env Settings
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  ;;  :config (setq exec-path (append exec-path '("/usr/local/bin")))
  )
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
(setq exec-path-from-shell-check-startup-files nil)
#+end_src
*** Undo Settings
#+begin_src emacs-lisp
(use-package undo-tree
  :init
  (global-undo-tree-mode)
  :ensure t
  :init (setq undo-tree-auto-save-history nil)
  )

#+end_src
*** Recentf Settings
#+begin_src emacs-lisp
(setq recentf-max-menu-items 50)
(setq-default
  recentf-max-saved-items 1000
  recentf-exclude `("/tmp/" "/ssh:" ,(concat package-user-dir "/.*-autoloads\\.el\\'")))
(recentf-mode t)
#+end_src
*** Show Startup Message
#+begin_src emacs-lisp
(setq inhibit-startup-message t)
#+end_src
** UI Setup
*** Menu-bar Hide
#+begin_src emacs-lisp
(menu-bar-mode nil)
#+end_src
*** Tool-bar Hide
#+begin_src emacs-lisp
(tool-bar-mode nil)
(tool-bar-mode -1)
#+end_src
*** Scroll-bar Hide
#+begin_src emacs-lisp
(scroll-bar-mode nil)
#+end_src
*** Theme
#+begin_src emacs-lisp
(use-package dracula-theme
  :ensure t
  )

(load-theme 'dracula t)
#+end_src
*** Cursor
#+begin_src emacs-lisp
(setq-default cursor-type 'bar)
(set-cursor-color "green")
(show-paren-mode t)
(setq show-paren-style 'expression)
(set-face-background 'show-paren-match (face-background 'default))
(set-face-attribute 'show-paren-match nil :weight 'extra-bold)

(add-hook 'minibuffer-setup-hook 'subword-mode)
#+end_src
*** FillColumn
#+begin_src emacs-lisp
(setq-default fill-column 150)
#+end_src
*** HighLight Line
#+begin_src emacs-lisp
(global-hl-line-mode t)
#+end_src
*** Font
#+begin_src emacs-lisp
(set-face-attribute 'default nil :font "DejaVu Sans Mono-18")
(global-font-lock-mode t)
(setq font-lock-maximum-size 5000000)
#+end_src
*** Mode Line
#+begin_src emacs-lisp
(use-package nyan-mode
  :ensure t
  :init
  (setq nyan-animate-nyancat t)
  (setq nyan-wavy-trail t)
  (setq nyan-minimum-window-width 80)
  (setq nyan-bar-length 20)
  (nyan-mode))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode t)
  :config
  (setq doom-modeline-height 5)
  (custom-set-faces
    '(mode-line ((t (:family "Ubuntu Mono" :height:50))))
    '(mode-line-inactive ((t (:family "Ubuntu Mono" :height:50))))
    )
  (doom-modeline-def-modeline 'ownml
    '(bar matches buffer-info remote-host buffer-position misc-info major-mode)
    '(input-method buffer-encoding process vcs checker))
  ;; Add to `doom-modeline-mode-hook` or other hooks
  (defun setup-custom-doom-modeline ()
    (doom-modeline-set-modeline 'ownml 'default))
  (add-hook 'doom-modeline-mode-hook 'setup-custom-doom-modeline)
  )

#+end_src
