configuration.org
*** Icons
#+begin_src emacs-lisp
(use-package all-the-icons)
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  )
#+end_src

*** Tabs Setup
**** Centaur-Tabs
#+begin_src emacs-lisp
(use-package centaur-tabs
  :demand
  :hook
  (dired-mode . centaur-tabs-local-mode)
  (dashboard-mode . centaur-tabs-local-mode)
  (term-mode . centaur-tabs-local-mode)
  (calendar-mode . centaur-tabs-local-mode)
  (org-agenda-mode . centaur-tabs-local-mode)
  (helpful-mode . centaur-tabs-local-mode)
  :config
  (setq
    centaur-tabs-style "bar"
    centaur-tabs-height 32
    centaur-tabs-set-icons t
    centaur-tabs-set-bar 'under
    x-underline-at-descent-line t
    centaur-tabs-show-count t
    centaur-tabs-set-close-button nil
    centaur-tabs-set-modified-marker t
    centaur-tabs-show-navigation-buttons t)
  (centaur-tabs-headline-match)
  (centaur-tabs-group-by-projectile-project)
  (centaur-tabs-mode t)

  :bind(
         ("s-1" . centaur-tabs-select-visible-tab)
         ("s-2" . centaur-tabs-select-visible-tab)
         ("s-3" . centaur-tabs-select-visible-tab)
         ("s-4" . centaur-tabs-select-visible-tab)
         ("s-5" . centaur-tabs-select-visible-tab)
         ("s-6" . centaur-tabs-select-visible-tab)
         ("s-7" . centaur-tabs-select-visible-tab)
         ("s-8" . centaur-tabs-select-visible-tab)
         ("s-9" . centaur-tabs-select-visible-tab)
         ("s-0" . centaur-tabs-select-visible-tab)

         ("C-c t s" . centaur-tabs-counsel-switch-group)
         ("C-c t p" . centaur-tabs-group-by-projectile-project)
         ("C-c t g" . centaur-tabs-group-buffer-groups)
         )

  )
#+end_src

*** DashBoard Setup
#+begin_src emacs-lisp
(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                     (boomarks . "book")
                                     ))
  (setq dashboard-banner-logo-title "Life is happy")
  (setq dashboard-startup-banner (expand-file-name "banner.png" user-emacs-directory))
  (setq dashboard-image-banner-max-height 100)
  (setq dashboard-center-content t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-set-navigator t)

  (setq dashboard-items '((recents  . 5)
                           (bookmarks . 5)
                           (projects . 5)
                           (agenda . 5)
                           ))
  (setq dashboard-projects-switch-function 'projectile-switch-project-by-name)
  (setq dashboard-page-separator "\n\f\n")
  )

(use-package page-break-lines)
#+end_src
** Which-Key Setup
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :config (which-key-mode)
  :bind ("M-m" . which-key-show-top-level)
  )
#+end_src
** Switch-Window
easy to jump windows
#+begin_src emacs-lisp
(use-package switch-window
  :ensure t
  :bind ("C-x o" . switch-window)
  :config
  (setq switch-window-shortcut-style 'qwerty)
  )
#+end_src
** Delete Setup
*** Hungry-delete
delete all whitespace until have character
#+begin_src emacs-lisp
(use-package hungry-delete
  :ensure t
  :bind (
          ("C-c DEL" . hungry-delete-backward)
          ("C-c d" . hungry-delete-forward))
  )
#+end_src
*** Delete Slection
#+begin_src emacs-lisp
(delete-selection-mode t)
#+end_src
** SmartParens
auto Symbol of completion
#+begin_src emacs-lisp
(use-package smartparens
  :ensure t
  :config
  (smartparens-global-mode t)
  (require 'smartparens-config)
  (sp-local-pair 'elisp-mode "'" nil :actions nil)
  (sp-local-pair 'elisp-mode "`" nil :actions nil)
  )
#+end_src
** Company Setup
#+begin_src emacs-lisp
(use-package company
  :ensure t
  :init
  (global-company-mode)
  :bind (
          :map company-active-map
          (("C-n"   . company-select-next)
            ("C-p"   . company-select-previous)
            ("C-d"   . company-show-doc-buffer)
            ("<tab>" . company-complete))
          )
  )
;; (use-package company-box
;;   :hook (company-mode . company-box-mode))

#+end_src
*** COMMENT +Company-Enghlish-helper+
#+begin_src emacs-lisp
(use-package company-english-helper
  :after quelpa quelpa-use-packages
  :quelpa (company-english-helper  :fetcher github :repo "manateelazycat/company-english-helper")
  ;;    :load-path (lambda () (expand-file-name "site-lisp/package/company-english-helper/" user-emacs-directory))
  :bind ("C-c C-e" . toggle-company-english-helper)
  )
(add-hook 'after-init-hook 'global-company-mode)
#+end_src
** Nginx Setup
#+begin_src emacs-lisp
(use-package nginx-mode)
(use-package company-nginx)
#+end_src
** MarkDown Setup
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode (("\\.md\\'" . gfm-mode)
          ("README" . gfm-mode)
          )
  :init (setq markdown-command "multimarkdown"))
#+end_src

** Projectile Setup
#+begin_src emacs-lisp
(use-package projectile
  :init
  (projectile-global-mode)
  :bind(
         ("C-x p f" . projectile-find-file)
         ("C-x p p" . projectile-switch-project)
         )
  :config
  (setq
    projectile-indexing-method 'hybrid
    ;;hybird, load .projectile and .gitignore ignorefile,Priority load .projectile
    ;;indexing default 'alien ,only load .gitignore
    ;;indexing 'native only load .projectile
    ;;.projectile rule: ignore: -/xxx ; exclude ignore: !/xxx ;

    ;;   projectile-sort-order 'recentf-active
    projectile-enable-caching t)
  (setq projectile-globally-ignored-directories
    (append (list
              ".pytest_cache"
              "__pycache__"
              "build"
              "elpa"
              "node_modules"
              "output"
              "reveal.js"
              "semanticdb"
              "target"
              "venv"
              )
      projectile-globally-ignored-directories))
  )
#+end_src
** Selected Setup
#+begin_src emacs-lisp
(use-package expand-region
  :bind ("C-=" . er/expand-region)
  :config
  (defun er/add-html-mode-expansions ()
    (make-variable-buffer-local 'er/try-expand-list)
    "Adds HTML-specific expansions for buffers in html-mode"
    (setq er/try-expand-list (append
                               er/try-expand-list
                               '(er/mark-html-attribute
                                  er/mark-inner-tag
                                  er/mark-outer-tag))))
  (add-hook 'web-mode-hook 'er/add-html-mode-expansions)
  (er/enable-mode-expansions 'web-mode 'er/add-html-mode-expansions)
  ;;:commands (er/expand-region er/enable-mode-expansions)
  )
#+end_src
** Command Completion For MiniBuffer
Command Interactive Completion ,eg : M-x
*** Ivy/Counsel/Swiper Setup
**** Ivy Setup
generic completion mechanism
***** Ivy
#+begin_src emacs-lisp
(use-package ivy
  :config
  (setq ivy-use-virtual-buffers t
    enable-recursive-minibuffers t
    )
  :bind(
         ("C-c C-r" . ivy-resume)
         )
  )

#+end_src
***** COMMENT Ivy-Rich
display more infomation in ivy buffer
#+begin_src emacs-lisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+end_src
***** COMMENT Ivy-PosFrame
show ivy buffer pop up box
#+begin_src emacs-lisp
(use-package ivy-posframe
  :init
  (setq ivy-posframe-display-functions-alist
    '((complete-symbol . ivy-posframe-display-at-point)
       (counsel-M-x     . ivy-posframe-display-at-frame-center)
       (t               . ivy-posframe-display-at-frame-center)))
  (ivy-posframe-mode 0)
  )
#+end_src
