README.md


<a id="org0c753ec"></a>

### Icons

    (use-package all-the-icons)
    (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode)
      )


<a id="orge09a7e4"></a>

### Tabs Setup

-   Centaur-Tabs

        (use-package centaur-tabs
          :demand
          :hook
          (dired-mode . centaur-tabs-local-mode)
          (dashboard-mode . centaur-tabs-local-mode)
          (term-mode . centaur-tabs-local-mode)
          (calendar-mode . centaur-tabs-local-mode)
          (org-agenda-mode . centaur-tabs-local-mode)
          (helpful-mode . centaur-tabs-local-mode)
          :config
          (setq
            centaur-tabs-style "bar"
            centaur-tabs-height 32
            centaur-tabs-set-icons t
            centaur-tabs-set-bar 'under
            x-underline-at-descent-line t
            centaur-tabs-show-count t
            centaur-tabs-set-close-button nil
            centaur-tabs-set-modified-marker t
            centaur-tabs-show-navigation-buttons t)
          (centaur-tabs-headline-match)
          (centaur-tabs-group-by-projectile-project)
          (centaur-tabs-mode t)
        
          :bind(
                 ("s-1" . centaur-tabs-select-visible-tab)
                 ("s-2" . centaur-tabs-select-visible-tab)
                 ("s-3" . centaur-tabs-select-visible-tab)
                 ("s-4" . centaur-tabs-select-visible-tab)
                 ("s-5" . centaur-tabs-select-visible-tab)
                 ("s-6" . centaur-tabs-select-visible-tab)
                 ("s-7" . centaur-tabs-select-visible-tab)
                 ("s-8" . centaur-tabs-select-visible-tab)
                 ("s-9" . centaur-tabs-select-visible-tab)
                 ("s-0" . centaur-tabs-select-visible-tab)
        
                 ("C-c t s" . centaur-tabs-counsel-switch-group)
                 ("C-c t p" . centaur-tabs-group-by-projectile-project)
                 ("C-c t g" . centaur-tabs-group-buffer-groups)
                 )
        
          )


<a id="orgd08a198"></a>

### DashBoard Setup

    (use-package dashboard
      :config
      (dashboard-setup-startup-hook)
      (dashboard-modify-heading-icons '((recents . "file-text")
                                         (boomarks . "book")
                                         ))
      (setq dashboard-banner-logo-title "Life is happy")
      (setq dashboard-startup-banner (expand-file-name "banner.png" user-emacs-directory))
      (setq dashboard-image-banner-max-height 100)
      (setq dashboard-center-content t)
      (setq dashboard-set-heading-icons t)
      (setq dashboard-set-file-icons t)
      (setq dashboard-set-navigator t)
    
      (setq dashboard-items '((recents  . 5)
                               (bookmarks . 5)
                               (projects . 5)
                               (agenda . 5)
                               ))
      (setq dashboard-projects-switch-function 'projectile-switch-project-by-name)
      (setq dashboard-page-separator "\n\f\n")
      )
    
    (use-package page-break-lines)


<a id="org92713bf"></a>

## Which-Key Setup

    (use-package which-key
      :ensure t
      :config (which-key-mode)
      :bind ("M-m" . which-key-show-top-level)
      )


<a id="orgfe20d9e"></a>

## Switch-Window

easy to jump windows

    (use-package switch-window
      :ensure t
      :bind ("C-x o" . switch-window)
      :config
      (setq switch-window-shortcut-style 'qwerty)
      )


<a id="orge05f217"></a>

## Delete Setup


<a id="orgb224d9d"></a>

### Hungry-delete

delete all whitespace until have character

    (use-package hungry-delete
      :ensure t
      :bind (
              ("C-c DEL" . hungry-delete-backward)
              ("C-c d" . hungry-delete-forward))
      )


<a id="orgbd46ec5"></a>

### Delete Slection

    (delete-selection-mode t)


<a id="org89e4448"></a>

## SmartParens

auto Symbol of completion

    (use-package smartparens
      :ensure t
      :config
      (smartparens-global-mode t)
      (require 'smartparens-config)
      (sp-local-pair 'elisp-mode "'" nil :actions nil)
      (sp-local-pair 'elisp-mode "`" nil :actions nil)
      )


<a id="org2d8a03c"></a>

## Company Setup

    (use-package company
      :ensure t
      :init
      (global-company-mode)
      :bind (
              :map company-active-map
              (("C-n"   . company-select-next)
                ("C-p"   . company-select-previous)
                ("C-d"   . company-show-doc-buffer)
                ("<tab>" . company-complete))
              )
      )
    ;; (use-package company-box
    ;;   :hook (company-mode . company-box-mode))


<a id="org97a7d86"></a>

## Nginx Setup

    (use-package nginx-mode)
    (use-package company-nginx)


<a id="org8f518cd"></a>

## MarkDown Setup

    (use-package markdown-mode
      :ensure t
      :mode (("\\.md\\'" . gfm-mode)
              ("README" . gfm-mode)
              )
      :init (setq markdown-command "multimarkdown"))


<a id="org0855097"></a>

## Projectile Setup

    (use-package projectile
      :init
      (projectile-global-mode)
      :bind(
             ("C-x p f" . projectile-find-file)
             ("C-x p p" . projectile-switch-project)
             )
      :config
      (setq
        projectile-indexing-method 'hybrid
        ;;hybird, load .projectile and .gitignore ignorefile,Priority load .projectile
        ;;indexing default 'alien ,only load .gitignore
        ;;indexing 'native only load .projectile
        ;;.projectile rule: ignore: -/xxx ; exclude ignore: !/xxx ;
    
        ;;   projectile-sort-order 'recentf-active
        projectile-enable-caching t)
      (setq projectile-globally-ignored-directories
        (append (list
                  ".pytest_cache"
                  "__pycache__"
                  "build"
                  "elpa"
                  "node_modules"
                  "output"
                  "reveal.js"
                  "semanticdb"
                  "target"
                  "venv"
                  )
          projectile-globally-ignored-directories))
      )


<a id="org080e15c"></a>

## Selected Setup

    (use-package expand-region
      :bind ("C-=" . er/expand-region)
      :config
      (defun er/add-html-mode-expansions ()
        (make-variable-buffer-local 'er/try-expand-list)
        "Adds HTML-specific expansions for buffers in html-mode"
        (setq er/try-expand-list (append
                                   er/try-expand-list
                                   '(er/mark-html-attribute
                                      er/mark-inner-tag
                                      er/mark-outer-tag))))
      (add-hook 'web-mode-hook 'er/add-html-mode-expansions)
      (er/enable-mode-expansions 'web-mode 'er/add-html-mode-expansions)
      ;;:commands (er/expand-region er/enable-mode-expansions)
      )


<a id="orgcf3b07d"></a>

## Command Completion For MiniBuffer

Command Interactive Completion ,eg : M-x


<a id="org6ab6e8f"></a>

### Ivy/Counsel/Swiper Setup

-   Ivy Setup

    generic completion mechanism
    
    -   Ivy
    
            (use-package ivy
              :config
              (setq ivy-use-virtual-buffers t
                enable-recursive-minibuffers t
                )
              :bind(
                     ("C-c C-r" . ivy-resume)
                     )
              )

-   Counsel Setup
