configuration.org
**** Counsel Setup
command completion use ivy
#+begin_src emacs-lisp
(use-package counsel
  :bind(
         ("M-x" . counsel-M-x)
         ("C-."   . 'counsel-imenu)
         ("C-c o"   . 'counsel-outline)
         ("C-x C-f" . counsel-find-file)
         ("C-c k" . counsel-ag)
         ("C-c g" . counsel-rg)
         ("C-h f" . 'counsel-describe-function)
         ("C-h v" . 'counsel-describe-variable)
         ("C-x b" . 'counsel-switch-buffer)
         ("C-c h" . 'counsel-recentf)
         )
  :hook (after-init . ivy-mode)
  )
(define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
;; counsel-locate find system file quicky
#+end_src
***** Show History Command in Counsel-M-x Minibuffer
show history command need amx package
#+begin_src emacs-lisp
(use-package amx
  :ensure t
  )
#+end_src
**** Swiper Setup
text search use ivy
#+begin_src emacs-lisp
(use-package swiper
  :bind(
         ("C-s" . swiper)
         ("C-'" . swiper-isearch-thing-at-point)
         )
  )
#+end_src
*** COMMENT +Smex+
#+begin_src emacs-lisp
(use-package smex
  )
#+end_src
*** COMMENT +Helm Setup+
#+begin_src emacs-lisp
(use-package helm
  :config (helm-mode t)
  :bind("M-x" . helm-M-x)
  )
#+end_src
** Iedit Setup
#+begin_src emacs-lisp
(use-package iedit
  :bind("C-c e" . iedit-mode)
  )
#+end_src
** Language Setup
*** LSP-Mode Setup
#+begin_src emacs-lisp
(use-package lsp-mode
  :ensure t
  :hook (
          (lsp-mode . lsp-enable-which-key-integration)
          (lsp-mode-hook . lsp-lens-mode)
          (prog-mode . lsp-deferred)
          )
  :commands lsp
  :bind
  (:map lsp-mode-map
    (("C-M-b" . lsp-find-implementation)
      ("M-RET" . lsp-execute-code-action)))
  :init (setq
          lsp-keymap-prefix "C-c l"              ; this is for which-key integration documentation, need to use lsp-mode-map
          read-process-output-max (* 1024 1024)  ; 1 mb
          lsp-completion-provider :capf
          lsp-completion-show-detail t
          lsp-completion-show-kind t
          lsp-idle-delay 0.500
          lsp-vetur-validation-template nil
          lsp-vetur-dev-log-level "DEBUG"
          lsp-vetur-format-default-formatter-css "none"
          lsp-vetur-format-default-formatter-html "none"
          lsp-vetur-format-default-formatter-js "none"
          lsp-enable-symbol-highlighting t
          lsp-lens-enable t
          lsp-headerline-breadcrumb-enable t
          lsp-modeline-code-actions-enable t
          lsp-modeline-diagnostics-enable t
          lsp-diagnostics-provider :flycheck
          lsp-eldoc-enable-hover t

          )
  :config
  (setq lsp-completion-enable-additional-text-edit nil)
  (setq lsp-intelephense-multi-root nil) ; don't scan unnecessary projects
  (with-eval-after-load 'lsp-intelephense
    (setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
  (define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
  ;; (add-hook 'lsp-mode-hook
  ;;           (lambda()
  ;;             (add-hook 'before-save-hook 'lsp-format-buffer nil t)))
  )

(use-package lsp-ui
  :commands lsp-ui-mode
  :config
  (setq lsp-ui-doc-enable nil)
  (setq lsp-ui-doc-header t)
  (setq lsp-ui-doc-include-signature t)
  (setq lsp-ui-doc-border (face-foreground 'default))
  (setq lsp-ui-sideline-show-code-actions t)
  (setq lsp-ui-sideline-delay 0.05))
#+end_src
*** Web-Mode Setup
#+begin_src emacs-lisp
(use-package web-mode
  :config
  (setq web-mode-markup-indent-offset 2
    web-mode-css-indent-offset 2
    web-mode-code-indent-offset 2
    )
  )

(defadvice web-mode-highlight-part (around tweak-jsx activate)
  (if (equal web-mode-content-type "jsx")
    (let ((web-mode-enable-part-face nil))
      ad-do-it)
    ad-do-it))

(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.js[x]?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
(use-package js2-mode
  )
(use-package json-mode
  )
(use-package prettier-js
  :ensure t
  ;; :config
  ;; (setq prettier-js-args '(
  ;;                          "--print-width" "200"  ;;一行代码的最大字符数,默认是80
  ;;                          "--trailing-comma" "all"  ;; 尾部逗号处理
  ;;                          "--bracket-spacing" "false" ;; > 是否另起一行
  ;;                          ))
  )
#+end_src
react configuration reference: [[http://codewinds.com/blog/2015-04-02-emacs-flycheck-eslint-jsx.html#emacs_configuration_for_eslint_and_jsx][configuration_react_jsx]]
*** Javascript REPL
**** js-comint
javascript REPL
#+begin_src emacs-lisp
(use-package js-comint)
#+end_src
**** skewer
live web REPL ,support javascript/css/html
#+begin_src emacs-lisp
(use-package simple-httpd)
(use-package skewer-mode)
#+end_src
**** indium
javascript developer environment for emacs
#+begin_src emacs-lisp
(use-package indium)
#+end_src
*** FlyCheck Setup
#+begin_src emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode)
  :config
  (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc))
  )



;; disable jshint since we prefer eslint checking
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(javascript-jshint)))
;; use eslint with web-mode for jsx files
(flycheck-add-mode 'javascript-eslint 'web-mode)
;; disable json-jsonlist checking for json files
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(json-jsonlist)))
#+end_src
*** Yasnippet Setup
#+begin_src emacs-lisp
(use-package yasnippet
  :config (yas-global-mode)
  )
(use-package yasnippet-snippets :ensure t)
#+end_src
*** Magit Setup
git tools
#+begin_src emacs-lisp
(use-package magit)
#+end_src
*** HideShow Setup
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'hs-minor-mode)
#+end_src
** Undo-Tree Setup
#+begin_src emacs-lisp
(use-package undo-tree
  :init (global-undo-tree-mode t)
  )
#+end_src
** Avy SetUp
jumping to visible text using a char-based decision tree
#+begin_src emacs-lisp
(use-package avy
  :bind("C-;" . avy-goto-char)
  )
#+end_src
** Org Setup
*** Org Table Tidy Settings
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (defun org-buffer-face-mode-variable ()
    (interactive)
    (make-face 'width-font-face)
    (set-face-attribute 'width-font-face nil :font "Ubuntu Mono 20")
    (setq buffer-face-mode-face 'width-font-face)
    (buffer-face-mode))
  (add-hook 'org-mode-hook 'org-buffer-face-mode-variable))
#+end_src
*** Pretty
#+begin_src emacs-lisp
(use-package org-bullets
  :ensure t
  :hook((org-mode . org-bullets-mode)
         (org-mode . org-indent-mode))
  ;;  (add-hook 'org-mode-hook #'org-bullets-mode)
  ;;  (add-hook 'org-mode-hook #'org-indent-mode)
  )
#+end_src
*** Org-babel support language
#+begin_src emacs-lisp
(require 'ob-js)
(add-to-list 'org-babel-load-languages '(js . t))
(org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
(add-to-list 'org-babel-tangle-lang-exts '("js" . "js"))
(defun ob-js-insert-session-header-arg (session)
  "Insert ob-js `SESSION' header argument.
- `js-comint'
- `skewer-mode'
- `Indium'
"
  (interactive (list (completing-read "ob-js session: "
                       '("js-comint" "skewer-mode" "indium"))))
  (org-babel-insert-header-arg
    "session"
    (pcase session
      ("js-comint" "\"*Javascript REPL*\"")
      ("skewer-mode" "\"*skewer-repl*\"")
      ("indium" "\"*JS REPL*\""))))
(define-key org-babel-map (kbd "J") 'ob-js-insert-session-header-arg)
#+end_src
