configuration.org
** Format Setup
#+begin_src emacs-lisp
(use-package format-all
  :ensure t
  :hook ((elixir-mode . format-all-mode)
          (prog-mode . format-all-mode))
  ;; :init
  ;;  (setq formatters '((lsp-mode . "lsp-format-buffer")))
  :config
  (add-hook 'format-all-mode-hook 'format-all-ensure-formatter)
  (add-hook 'before-save-hook 'format-all-buffer)
  )
#+end_src
*** Format Default Formatters Setup
#+begin_src emacs-lisp
(custom-set-variables
  '(format-all-default-formatters
     '(("Assembly" asmfmt)
        ("ATS" atsfmt)
        ("Bazel" buildifier)
        ("BibTeX" emacs-bibtex)
        ("C" clang-format)
        ("C#" clang-format)
        ("C++" clang-format)
        ("Cabal Config" cabal-fmt)
        ("Clojure" zprint)
        ("CMake" cmake-format)
        ("Crystal" crystal)
        ("CSS" prettier)
        ("Cuda" clang-format)
        ("D" dfmt)
        ("Dart" dart-format)
        ("Dhall" dhall)
        ("Dockerfile" dockfmt)
        ("Elixir" mix-format)
        ("Elm" elm-format)
        ("Emacs Lisp" emacs-lisp)
        ("Erlang" efmt)
        ("F#" fantomas)
        ("Fish" fish-indent)
        ("Fortran Free Form" fprettify)
        ("GLSL" clang-format)
        ("Go" gofmt)
        ("GraphQL" prettier)
        ("Haskell" brittany)
        ("HTML" prettier)
        ("HTML+EEX" mix-format)
        ("HTML+ERB" erb-format)
        ("Java" clang-format)
        ("JavaScript" prettier)
        ("JSON" prettier)
        ("JSON5" prettier)
        ("Jsonnet" jsonnetfmt)
        ("JSX" prettier)
        ("Kotlin" ktlint)
        ("LaTeX" latexindent)
        ("Less" prettier)
        ("Literate Haskell" brittany)
        ("Lua" lua-fmt)
        ("Markdown" prettier)
        ("Nix" nixpkgs-fmt)
        ("Objective-C" clang-format)
        ("OCaml" ocp-indent)
        ("Perl" perltidy)
        ("PHP" prettier)
        ("Protocol Buffer" clang-format)
        ("PureScript" purty)
        ("Python" black)
        ("R" styler)
        ("Reason" bsrefmt)
        ("ReScript" rescript)
        ("Ruby" rufo)
        ("Rust" rustfmt)
        ("Scala" scalafmt)
        ("SCSS" prettier)
        ("Shell" shfmt)
        ("Solidity" prettier)
        ("SQL" sqlformat)
        ("Svelte" prettier)
        ("Swift" swiftformat)
        ("Terraform" terraform-fmt)
        ("TOML" prettier)
        ("TSX" prettier)
        ("TypeScript" prettier)
        ("V" v-fmt)
        ("Verilog" istyle-verilog)
        ("Vue" prettier)
        ("XML" html-tidy)
        ("YAML" prettier)
        ("Zig" zig)
        ("_Angular" prettier)
        ("_Flow" prettier)
        ("_Gleam" gleam)
        ("_Ledger" ledger-mode)
        ("_Nginx" nginxfmt)
        ("_Snakemake" snakefmt)))
  )
#+end_src
** Org shortcut
*** Motion in Heading
**** Next Heading
C-c C-n (org-next-visible-heading)

**** Previous Heading
C-c C-p (org-next-visible-heading)

**** Next Same Level
C-c C-f (org-forward-heading-same-level)

**** Previous Same Heading
C-c C-b (org-backward-heading-same-level)

**** Previous Higher Heading
C-c C-u (outline-up-heading)
*** Editing Heading Level
**** Insert Previous Same Level Heading
M-RET (org-meta-return)
**** Insert Next Same Level Heading
C-RET (org-insert-heading-respect-contents)
**** Move Previous Heading
M-UP (org-move-subtree-up)
**** Move Next Heading
M-DOWN (org-move-subtree-down)
**** Promote Heading
M-LEFT (org-do-promote)
**** Demote Heading
M-RIGHT (org-do-demote)
**** Promote Heading and subtree
M-S-LEFT (org-promote-subtree)
**** Demote Heading and subtree
M-S-RIGHT (org-demote-subtree)
*** Insert Org template
C-c C-, (org-insert-structure-template)
**** Insert Source Code Block
Key "s in (org-insert-structure-template) list
*** Other
**** StrikeThrough/DeleteLine
command: (org-emphasize) ,next input character (+)
**** Disable Source Code
C-c ; (org-toggle-comment)
**** Edit Source Code In New Buffer
C-c ' (org-edit-special)

** Installation
#+begin_src shell
  git clone <this repo url> ~/.emacs.d
#+end_src

** Customize Your Configuration
write your configuration to ~/.emacs.d/configuration_self.org . emacs autoload the file when emacs startup
