README.md


<a id="org3bb979a"></a>

## Format Setup

    (use-package format-all
      :ensure t
      :hook ((elixir-mode . format-all-mode)
              (prog-mode . format-all-mode))
      ;; :init
      ;;  (setq formatters '((lsp-mode . "lsp-format-buffer")))
      :config
      (add-hook 'format-all-mode-hook 'format-all-ensure-formatter)
      (add-hook 'before-save-hook 'format-all-buffer)
      )


<a id="orgc2fc0ef"></a>

### Format Default Formatters Setup

    (custom-set-variables
      '(format-all-default-formatters
         '(("Assembly" asmfmt)
            ("ATS" atsfmt)
            ("Bazel" buildifier)
            ("BibTeX" emacs-bibtex)
            ("C" clang-format)
            ("C#" clang-format)
            ("C++" clang-format)
            ("Cabal Config" cabal-fmt)
            ("Clojure" zprint)
            ("CMake" cmake-format)
            ("Crystal" crystal)
            ("CSS" prettier)
            ("Cuda" clang-format)
            ("D" dfmt)
            ("Dart" dart-format)
            ("Dhall" dhall)
            ("Dockerfile" dockfmt)
            ("Elixir" mix-format)
            ("Elm" elm-format)
            ("Emacs Lisp" emacs-lisp)
            ("Erlang" efmt)
            ("F#" fantomas)
            ("Fish" fish-indent)
            ("Fortran Free Form" fprettify)
            ("GLSL" clang-format)
            ("Go" gofmt)
            ("GraphQL" prettier)
            ("Haskell" brittany)
            ("HTML" prettier)
            ("HTML+EEX" mix-format)
            ("HTML+ERB" erb-format)
            ("Java" clang-format)
            ("JavaScript" prettier)
            ("JSON" prettier)
            ("JSON5" prettier)
            ("Jsonnet" jsonnetfmt)
            ("JSX" prettier)
            ("Kotlin" ktlint)
            ("LaTeX" latexindent)
            ("Less" prettier)
            ("Literate Haskell" brittany)
            ("Lua" lua-fmt)
            ("Markdown" prettier)
            ("Nix" nixpkgs-fmt)
            ("Objective-C" clang-format)
            ("OCaml" ocp-indent)
            ("Perl" perltidy)
            ("PHP" prettier)
            ("Protocol Buffer" clang-format)
            ("PureScript" purty)
            ("Python" black)
            ("R" styler)
            ("Reason" bsrefmt)
            ("ReScript" rescript)
            ("Ruby" rufo)
            ("Rust" rustfmt)
            ("Scala" scalafmt)
            ("SCSS" prettier)
            ("Shell" shfmt)
            ("Solidity" prettier)
            ("SQL" sqlformat)
            ("Svelte" prettier)
            ("Swift" swiftformat)
            ("Terraform" terraform-fmt)
            ("TOML" prettier)
            ("TSX" prettier)
            ("TypeScript" prettier)
            ("V" v-fmt)
            ("Verilog" istyle-verilog)
            ("Vue" prettier)
            ("XML" html-tidy)
            ("YAML" prettier)
            ("Zig" zig)
            ("_Angular" prettier)
            ("_Flow" prettier)
            ("_Gleam" gleam)
            ("_Ledger" ledger-mode)
            ("_Nginx" nginxfmt)
            ("_Snakemake" snakefmt)))
      )


<a id="org6df1132"></a>

## Org shortcut


<a id="org7b4e05a"></a>

### Motion in Heading

-   Next Heading

    C-c C-n (org-next-visible-heading)

-   Previous Heading

    C-c C-p (org-next-visible-heading)

-   Next Same Level

    C-c C-f (org-forward-heading-same-level)

-   Previous Same Heading

    C-c C-b (org-backward-heading-same-level)

-   Previous Higher Heading

    C-c C-u (outline-up-heading)


<a id="org80d0188"></a>

### Editing Heading Level

-   Insert Previous Same Level Heading

    M-RET (org-meta-return)

-   Insert Next Same Level Heading

    C-RET (org-insert-heading-respect-contents)

-   Move Previous Heading

    M-UP (org-move-subtree-up)

-   Move Next Heading

    M-DOWN (org-move-subtree-down)

-   Promote Heading

    M-LEFT (org-do-promote)

-   Demote Heading

    M-RIGHT (org-do-demote)

-   Promote Heading and subtree

    M-S-LEFT (org-promote-subtree)

-   Demote Heading and subtree

    M-S-RIGHT (org-demote-subtree)


<a id="orgb815ae1"></a>

### Insert Org template

C-c C-, (org-insert-structure-template)

-   Insert Source Code Block

    Key "s in (org-insert-structure-template) list


<a id="org8373792"></a>

### Other

-   StrikeThrough/DeleteLine

    command: (org-emphasize) ,next input character (+)

-   Disable Source Code

    C-c ; (org-toggle-comment)

-   Edit Source Code In New Buffer

    C-c ' (org-edit-special)


<a id="org00dbd9c"></a>

## Installation

    git clone <this repo url> ~/.emacs.d


<a id="org1dfa657"></a>

## Customize Your Configuration

write your configuration to ~/.emacs.d/configuration<sub>self.org</sub> . emacs autoload the file when emacs startup

